app/controllers/items_controller.rb

INSERT INTO "items" ("name", "list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Ham"], ["list_id", "1"], ["created_at", "2017-04-19 09:55:14.648738"], ["updated_at", "2017-04-19 09:55:14.648738"]]
---
  def create
    @item = Item.new(params.require(:item).permit(:name,:list_id))
    if @item.save